In [4]:
import pandas as pd

In [5]:
dados = pd.read_csv('fifa.csv')

In [ ]:
dados

In [ ]:
dados.sort_values(['Name', 'Age'])

In [ ]:
dados.sort_values('Weight', ascending=False)

In [10]:
dados.iloc[2,2]

'Neymar Jr'

In [ ]:
dados.iloc[69]

In [6]:
dados['Total'] = (dados['SprintSpeed'] + dados['Agility'] + dados['Reactions'] + dados['Jumping'])/4

In [ ]:
dados['Total']

In [11]:
dados2 = dados[['Name', 'Total']]
dados2.sort_values('Total', ascending=False)

                    Name  Total
1      Cristiano Ronaldo  92.25
17          A. Griezmann  88.75
1226       F. Acheampong  88.25
25             K. Mbappé  87.50
1835          T. Bifouma  87.25
...                  ...    ...
13279       P. Mazzocchi    NaN
13280          Y. Ammour    NaN
13281     Jwa Joon Hyeop    NaN
13282         O. Marrufo    NaN
13283        Han Pengfei    NaN

[18207 rows x 2 columns]

In [12]:
dados2.head(5)

                Name  Total
0           L. Messi  85.00
1  Cristiano Ronaldo  92.25
2          Neymar Jr  85.25
3             De Gea  68.75
4       K. De Bruyne  77.25

In [14]:
dados3 = dados2.head(5)
dados3

                Name  Total
0           L. Messi  85.00
1  Cristiano Ronaldo  92.25
2          Neymar Jr  85.25
3             De Gea  68.75
4       K. De Bruyne  77.25

In [16]:
dados3.to_csv('dados.csv', index=False) # eh assim q exporta

In [20]:
dados3.to_csv('dados3.txt') # gambiarra pra txt

In [ ]:
dados3.to_csv('dados_bonitos.txt', index=False, sep='\t') # exportar oferce bastante coisa